
//
// Transliteracija tradicionnoj russkoj kirilicy v russkuju latinicu.

// Primeçanije:
// Bukvy "J" i "E" otsutstvujut vvidu nenużnosti, a bukva "Sç"
// peredajetsä v pisjme digramfom.

module.exports = {
    'А': 'A',
    'а': 'a',

    'Б': 'B',
    'б': 'b',

    'В': 'V',
    'в': 'v',

    'Г': 'G',
    'г': 'g',

    'Д': 'D',
    'д': 'd',

    'Е': 'E',
    'е': 'e',

    'Ё': 'Ö',
    'ё': 'ö',

    'Ж': 'Ƶ',
    'ж': 'ƶ',

    'З': 'Z',
    'з': 'z',

    'И': 'I',
    'и': 'i',

    'Й': 'J',
    'й': 'j',

    'К': 'K',
    'к': 'k',

    'Л': 'L',
    'л': 'l',

    'М': 'M',
    'м': 'm',

    'Н': 'N',
    'н': 'n',

    'О': 'O',
    'о': 'o',

    'П': 'P',
    'п': 'p',

    'Р': 'R',
    'р': 'r',

    'С': 'S',
    'с': 's',

    'Т': 'T',
    'т': 't',

    'У': 'U',
    'у': 'u',

    'Ф': 'F',
    'ф': 'f',

    'Х': 'X',
    'х': 'x',

    'Ц': 'Ç',
    'ц': 'ç',

    'Ч': 'С',
    'ч': 'с',

    'Ш': 'Ş',
    'ш': 'ş',

    'Щ': 'Sс',
    'щ': 'sс',

    'Ъ': '',
    'ъ': '',

    'Ы': 'Y',
    'ы': 'y',

    'Ь': 'J',
    'ь': 'j',

    'Э': 'E',
    'э': 'e',

    'Ю': 'Ü',
    'ю': 'ü',

    'Я': 'Ä',
    'я': 'ä',
};
